In [3]:
import numpy as np
import pandas as pd

Task 1:
- вивести 7 перших рядків
- вивести загальну інформацію про датасет
- Середнє значення по BasePay             
- Найбільше OvertimePay у наборі даних
- Яка робота в  JOSEPH DRISCOLL 
- Скільки заробляє JOSEPH DRISCOLL
- Хто найбільше заробляє (з премією)
- Яким був середній  BasePay усіх працівників на рік?
- Які 5 найпоширеніших робочих місць?
- Скільки посад у 2013 році представляла лише одна людина? 
- Скільки людей має слово начальник у назві посади?
- Чи існує взаємозв'язок між довжиною рядка посади та посадовим окладом

In [4]:
# зчитати файл
df = pd.read_csv('Salaries.csv')

In [5]:
df.head(3) #виводить рядки(кількість). Якщо записати df.head(), то отримаємо перших 5 рядків за замовчуванням

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011.0,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011.0,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011.0,NaN,San Francisco,NaN

In [6]:
df.tail() # останні 5-ть рядочків вивести

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.0,0.0,0.0,0.0,0.0,0.0,2014.0,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.0,0.0,2014.0,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.0,0.0,2014.0,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.0,0.0,2014.0,NaN,San Francisco,NaN
148653,"148654,Joe Lopez,""Counselor, Log Cabin Ranch"",...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
df.columns # виводить назви колонок(стовпців)

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  object
 1   EmployeeName      141900 non-null  object
 2   JobTitle          141900 non-null  object
 3   BasePay           141368 non-null  float64
 4   OvertimePay       141896 non-null  float64
 5   OtherPay          141896 non-null  float64
 6   Benefits          107331 non-null  float64
 7   TotalPay          141900 non-null  float64
 8   TotalPayBenefits  141900 non-null  float64
 9   Year              141900 non-null  float64
 10  Notes             0 non-null       float64
 11  Agency            141900 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(9), object(4)
memory usage: 14.7+ MB

In [10]:
df['Year'] # вивести колонку Year

0         2011.0
1         2011.0
2         2011.0
3         2011.0
4            NaN
           ...
148649    2014.0
148650    2014.0
148651    2014.0
148652    2014.0
148653       NaN
Name: Year, Length: 148654, dtype: float64

In [12]:
# Змінити тип колонки Year з float64 на time
pd.to_datetime(df['Year'], format="%Y" )

0        2011-01-01
1        2011-01-01
2        2011-01-01
3        2011-01-01
4               NaT
            ...
148649   2014-01-01
148650   2014-01-01
148651   2014-01-01
148652   2014-01-01
148653          NaT
Name: Year, Length: 148654, dtype: datetime64[ns]

In [21]:
# # записати у нову змінну, зробити копію, та записати в ексель
# df1 = df[:50_000].copy()
# df1['BasePay'] = 0
# df1.to_excel('file.xlsx')

In [22]:
# df1 = df[:50_000]
# df1
# df1.shape

(50000, 13)

In [25]:
# Середнє значення по BasePay 
df.groupby(['Year'])['BasePay'].mean()

Year
2011.0    62737.036665
2012.0    64819.437350
2013.0    68946.639050
2014.0    65913.837691
Name: BasePay, dtype: float64

In [27]:
df.groupby(['Year']).agg({'BasePay' : 'mean'})

             BasePay
Year
2011.0  62737.036665
2012.0  64819.437350
2013.0  68946.639050
2014.0  65913.837691